cnf/Documents/ПриходнаяНакладная.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Document>
		<Properties>
			<Name>ПриходнаяНакладная</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Материал</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cnf/Documents/ПриходнаяНакладная/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры  &НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
  СтрокаТабличнойЧасти = Элементы.Материалы.ТекущиеДанные;
  РаботаСДокументами.РассчитатьСумму(СтрокаТабличнойЧасти);
КонецПроцедуры

  &НаКлиенте
Процедура КомментарийОткрытие(Элемент, СтандартнаяОбработка)  
	СтандартнаяОбработка = Ложь;
	Оповещение = Новый ОписаниеОповещения("подкл_ОповещениеИзмененияКомментария", ЭтаФорма);
	ПараметрыНовойФормы = Новый Структура;
	ПараметрыНовойФормы.Вставить("ЗаполненныйКомментарий", Объект.Комментарий); 
	ОткрытьФорму("Документ.ПриходнаяНакладная.Форма.ФормаВводаКомментария",ПараметрыНовойФормы, ЭтаФорма,,,,Оповещение);
	a = 1;   
КонецПроцедуры

  &НаКлиенте
Процедура подкл_ОповещениеИзмененияКомментария(Результат, ДополнительныеПараметры) Экспорт  
	
	Если НЕ Результат = Неопределено Тогда 
	Объект.Комментарий = Результат; 
	КонецЕсли;
КонецПроцедуры                                                                     

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ТекущийОбъект.Склад.ЗапретОприходования = Истина 
		И ТекущийОбъект.Склад.ДатаЗапретаОприходования <= ТекущийОбъект.Дата Тогда
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Для данного склада запрещено создавать приходные накладные!";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Для каждого Строка Из ТекущийОбъект.Материалы Цикл
    Если Строка.Материал.ЗапретОприходования = Истина
    И Строка.Материал.ДатаЗапретаОприходования <= ТекущийОбъект.Дата Тогда
      Отказ = Истина;
      Сообщение = Новый СообщениеПользователю;
      Сообщение.Текст = "Для номенклатуры """ + Строка.Материал + """ запрещено оприходование!";
      Сообщение.Сообщить();
    КонецЕсли;
    КонецЦикла;
  КонецПроцедуры
